// @file
//
//Copyright (c) 2006 - 2011, Byosoft Corporation.<BR> 
//All rights reserved.This software and associated documentation (if any)
//is furnished under a license and may only be used or copied in 
//accordance with the terms of the license. Except as permitted by such
//license, no part of this software or documentation may be reproduced, 
//stored in a retrieval system, or transmitted in any form or by any 
//means without the express written consent of Byosoft Corporation.
//
//File Name:
//  tcmSetup.uni
//
//Abstract: 
//  Dxe part of TCM Module.
//
//Revision History:
//
//Bug 3075 - Add TCM support.
//TIME: 2011-11-14
//$AUTHOR: Zhang Lin
//$REVIEWERS: 
//$SCOPE: SugarBay
//$TECHNICAL: 
//  1. Tcm module init version.
//     Only support setup function.
//$END--------------------------------------------------------------------
//
//



///*++
//Copyright (c) 2010 Intel Corporation. All rights reserved.
//This software and associated documentation (if any) is furnished
//under a license and may only be used or copied in accordance
//with the terms of the license. Except as permitted by such
//license, no part of this software or documentation may be
//reproduced, stored in a retrieval system, or transmitted in any
//form or by any means without the express written consent of
//Intel Corporation.
//
//Module Name:
//
//  TcgSetup.uni
//
//Abstract:
//
// TcgSetup  Setup strings.
//--*/
/=#

#langdef   en-US "en-USlish"
#langdef   fr-FR "Français"

// TPM 
#string STR_TCM_TITLE                      #language en-US "TCM"
#string STR_TCM_HELP                       #language en-US "Press <Enter> to select the TCM Setup options."
#string STR_TCM_DEVICE_PROMPT              #language en-US "  TCM Enable State"
#string STR_TCM_DEVICE_HELP                #language en-US "Enable/Disable the TCM device."
#string STR_TCM_STATE_PROMPT               #language en-US "  TCM Activate State"
#string STR_TCM_STATE_HELP                 #language en-US "Activate/Deactivate the TCM device, setting takes effect on the next boot."
#string STR_ACTIVATE                       #language en-US "Activate"
#string STR_DEACTIVATE                     #language en-US "Deactivate"
#string STR_TCM_FORCE_CLEAR_PROMPT         #language en-US "  Force TCM Clear"
#string STR_TCM_FORCE_CLEAR_HELP           #language en-US "Force Clear TCM data, setting takes effect on the next boot."
#string STR_MOR_PROMPT                     #language en-US "MOR State"
#string STR_MOR_HELP                       #language en-US "Enable/Disable the MOR (Memory Overwrite Request) feature"
#string STR_NULL_STRING                    #language en-US ""

// Enable or Disable
#string STR_ENABLE                         #language en-US  "Enable"
#string STR_DISABLE                        #language en-US  "Disable"
#string STR_AUTO                           #language en-US  "Auto"
#string STR_EMPTY                          #language en-US  ""